In [1]:
%load_ext sql
%sql sqlite:///PS1.db

/Library/anaconda/envs/python2/lib/python2.7/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/Library/anaconda/envs/python2/lib/python2.7/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

u'Connected: None@PS1.db'

Problem Set 1
=======


### Instructions / Notes:

**_Read these carefully_**

* Run the top cell above to load the database `PS1.db` (make sure the actual database file, `PS1.db`, is in the same directory as this IPython notebook is running in)
* Some of the problems involve _changing_ this database (e.g. deleting rows)- you can always re-download `PS1.db` or make a copy if you want to start fresh!
* You **may** create new IPython notebook cells to use for e.g. testing, debugging, exploring, etc.- this is encouraged in fact!- **just make sure that your final answer for each question is _in its own cell_ and _clearly indicated_**
* When you see `In [*]:` to the left of the cell you are executing, this means that the code / query is _running_.
    * **If the cell is hanging- i.e. running for too long: To restart the SQL connection, you must restart the entire python kernel**
    * To restart kernel using the menu bar: "Kernel >> Restart >> Clear all outputs & restart"), then re-execute the sql connection cell at top
    * You will also need to restart the connection if you want to load a different version of the database file
* Remember:
    * `%sql [SQL]` is for _single line_ SQL queries
    * `%%sql [SQL]` is for _multi line_ SQL queries
* **See Piazza for submission instructions**
* _Have fun!_

Problem 1: Matrix Manipulations
------------------------

Two random 3x3 ($N=3$) matrices have been provided in tables `A` and `B`, having the following schema:
> * `i INT`:   Row index
> * `j INT`:   Column index
> * `val INT`: Cell value

**Note: all of your answers below _must_ work for any _square_ matrix sizes, i.e. any value of $N$**.

Note how the matrices are represented- why do we choose this format?  Run the following queries to see the matrices in a nice format:

In [2]:
%sql SELECT group_concat(val, " , ") AS "A" FROM A GROUP BY i;

Done.

[(u'7 , 5 , 8',), (u'10 , 7 , 7',), (u'2 , 0 , 5',)]

In [3]:
%sql SELECT group_concat(val, " , ") AS "B" FROM B GROUP BY i;

Done.

[(u'9 , 6 , 10',), (u'7 , 6 , 9',), (u'1 , 1 , 7',)]

### Part (a): Elementwise multiplication

We want the _elementwise multiply_ of matrices A and B. That is,
$(A\cdot B)_{ij} = A_{ij}B_{ij}$ for all $i,j$.

Write a _single SQL query_ that performs this operation (in the same format as $A$- output tuples should be of format `(i,j,val)` where `i` is row, `j` is column, and the output is ordered by row then column index)

Write your query here:

In [4]:
%%sql SELECT A.i,A.j,A.val*B.val as val
FROM A, B
WHERE A.i=B.i and A.j=B.j;

Done.

[(0, 0, 63),
 (0, 1, 30),
 (0, 2, 80),
 (1, 0, 70),
 (1, 1, 42),
 (1, 2, 63),
 (2, 0, 2),
 (2, 1, 0),
 (2, 2, 35)]

### Part (b): Permutations

A _permutation_ is a mapping from a set of integers to itself, i.e. $\pi:[n] \rightarrow [n]$, where $[n]$ denotes the set $\{0,\ldots, n-1\}$.

We write
$$
    \pi([a_1, a_2, \ldots, a_n]) 
    = [a_{\pi(1)},a_{\pi(2)}, \ldots a_{\pi(n)} ]
$$

The provided table $c$ contains a permutation on $[3]$.

In [5]:
%sql SELECT * FROM c;

Done.

[(0, 1), (1, 2), (2, 0)]

Write a _single SQL query_ that permutes the rows of matrix $A$ according to the permutation stored in $c$.

$$
(i,j,A_{ij}) \rightarrow (i,j,A_{\pi(i)j})
$$

For the example provided, this means a single-step cyclic upward shift, however your code needs to work for any input $A,c$ of the right dimensions.

Write your query here:

In [6]:
%%sql SELECT c.ind as i, A.j, A.val
    FROM A, c
    WHERE A.i=c.pi
    ORDER BY c.ind;

Done.

[(0, 0, 10),
 (0, 1, 7),
 (0, 2, 7),
 (1, 0, 2),
 (1, 1, 0),
 (1, 2, 5),
 (2, 0, 7),
 (2, 1, 5),
 (2, 2, 8)]

### Part (c): Composability of permutations

A known property of permutations, is that they are closed under composition. This implies that applying two permutations in succession is equivalent to applying a different, single permutation.
$$
    \pi_2(\pi_1([a_1, a_2, \ldots, a_n]))
    = [a_{\pi(1)},a_{\pi(2)}, \ldots a_{\pi(n)} ]
$$
where $\pi(i) = \pi_2(\pi_1(i))$.

Write a _single SQL query_ that applies the permuation in table $c$ twice on the rows of matrix $A$.

$$
(i,j,A_{ij}) \rightarrow (i,j,A_{\pi(\pi(i))j})
$$

For the example provided, this means a two-step cyclic upward shift, however your code needs to work for any input $A,c$ of the right dimensions.

Write your query here:

#### SOLUTION 1: Composition

In [7]:
%%sql SELECT comp.ind as i, A.j, A.val
    FROM A, (
        SELECT c1.ind as ind, c2.pi
        FROM c c1, c c2
        WHERE c1.pi=c2.ind
    ) as comp
    WHERE A.i=comp.pi
    ORDER BY comp.ind;

Done.

[(0, 0, 2),
 (0, 1, 0),
 (0, 2, 5),
 (1, 0, 7),
 (1, 1, 5),
 (1, 2, 8),
 (2, 0, 10),
 (2, 1, 7),
 (2, 2, 7)]

#### SOLUTION 2: Successive application

In [8]:
%%sql SELECT c2.ind as i, A.j, A.val
    FROM A
    JOIN c c1 ON A.i=c1.pi
    JOIN c c2 ON c1.ind=c2.pi
    ORDER BY c2.ind;

Done.

[(0, 0, 2),
 (0, 1, 0),
 (0, 2, 5),
 (1, 0, 7),
 (1, 1, 5),
 (1, 2, 8),
 (2, 0, 10),
 (2, 1, 7),
 (2, 2, 7)]

### Part (d): Local maximum

Consider the _local maximum_ matrix function, 
$MAX:\mathbb{R}^{n,n} \rightarrow \mathbb{R}^{n,n}$:

$$
    MAX(A)_{ij} = \max \{ A_{ij} \textrm{ and cells up, down, left, right }\}
$$

that is, if

$$A=\begin{bmatrix}a & b & c\\ d & e & f\\ g & h & i\end{bmatrix}$$

then

$$
    MAX(A)_{00} = \max \{ a,b,d \},
$$

$$
    MAX(A)_{01} = \max \{ a,d,g,e \},
$$

and

$$
    MAX(A)_{11} = \max \{ d,b,e,h,f \}.
$$

Write a _single SQL query_ that computes the local maximum of matrix $A$.

Write your query here:

In [9]:
%%sql SELECT a1.i, a1.j, max(a2.val) as val
FROM A a1, A a2
WHERE abs(a1.i-a2.i) + abs(a1.j-a2.j)<=1
GROUP BY a1.i, a1.j;

Done.

[(0, 0, 10),
 (0, 1, 8),
 (0, 2, 8),
 (1, 0, 10),
 (1, 1, 10),
 (1, 2, 8),
 (2, 0, 10),
 (2, 1, 7),
 (2, 2, 7)]

Problem 2: U.S. Sustainable Energy Sources
----------------------------------------------

We've prepared and loaded a [public dataset](https://catalog.data.gov/dataset/energy-generation-by-state-and-technology-2009-69f4f) from the US DOE (Department of Energy) of sustainable energy production in MWh (megawatt hours, i.e., 1000 [kilowatt hours](https://en.wikipedia.org/wiki/Kilowatt_hour)). This data is from 2009, the latest year available.  The data includes each state, the region of the United States it is in, and its production in MWh of sustainable energy by source (solar, wind, hydroelectric, and nuclear). The table `energy` has the following schema:
```
TABLE energy (
    state varchar(30),
    region varchar(30),
    solar float,
    wind float,
    hydro float,
    nuclear float)
```

In [10]:
%sql SELECT * FROM energy LIMIT 3;

Done.

[(u'Alabama', u'Southeast', 0.0, 0.0, 11753493.37, 39716204.0),
 (u'Alaska', u'Alaska', 0.0, 3062.442, 1204550.392, 0.0),
 (u'Arizona', u'West', 13759.445, 9555.0, 6348462.992, 30661851.0)]

### Part (a): Regional Champions

Using a _single SQL query_, find all of the regions in the United States with a state in it that is the leading producer of one of the four types of energy (solar, wind, hydro, and nuclear), and return the counts of how many state winners they had in descending order. **Do not include any regions with no state winners.**

Further requirements:
* Use `GROUP BY`
* Write the shortest possible SQL query to accomplish this
* Return relation `(region, num_state_winners)`

Write your query here:

In [11]:
%%sql
SELECT region, COUNT(region) as num_state_winners
FROM 
    energy,
    (SELECT MAX(solar) AS maxsolar,
     MAX(wind) AS maxwind,
     MAX(hydro) AS maxhydro,
     MAX(nuclear) AS maxnuclear
     FROM energy)
WHERE solar = maxsolar OR wind = maxwind OR hydro = maxhydro OR nuclear = maxnuclear
GROUP BY region
ORDER BY num_state_winners DESC;

Done.

[(u'West', 2), (u'Midwest', 1), (u'Southeast', 1)]

### Part (b): Pareto Frontiers

Solar power and wind power [tend to be complementary](https://en.wikipedia.org/wiki/Wind_power#Variability), since it tends to be less windy when there are few clouds and the sun can best reach solar panels.

Our goal in this part is to identify states that strike the best balance between solar and wind energy production. Here we define a state as "best" if it exists on the [Pareto frontier](https://en.wikipedia.org/wiki/Pareto_efficiency#Formal_representation) of solar and wind energy production. In other words, a state is Pareto optimal if no other state produces **both more solar and more wind energy**, and the Pareto frontier is the set of states that are Pareto optimal.

Write a query that returns the entire Pareto frontier. Results should be triples of the form `(state, solar, wind)`, where `state` is the name of the state in the frotier, and `solar` and `wind` are its solar and wind energy production in MWh. Order the results in descending order by sum total of solar and wind energy production in MWh.

Write your query here:

In [12]:
%%sql
SELECT state, solar, wind FROM (
    SELECT state, solar, wind, (solar + wind) as sum
    FROM energy as e1
    WHERE NOT EXISTS (
        SELECT e2.solar, e2.wind
        FROM energy as e2
        WHERE e2.solar >= e1.solar
            AND e2.wind > e1.wind)
    AND NOT EXISTS (
        SELECT e2.solar, e2.wind
        FROM energy as e2
        WHERE e2.solar > e1.solar
            AND e2.wind >= e1.wind)
    )
ORDER BY sum DESC;

Done.

[(u'Texas', 0.0, 19367238.86), (u'California', 611763.387, 5764637.309)]

### Part (c):

Find a list of regions which had a minimum state nuclear power within _10% of the maximum state nuclear power value_ (where _minimum state nuclear power_ = minimum value of nuclear power production over all states with non-zero nuclear production).

*Note: do not hard-code the maximum state nuclear power or any other input-data-dependent values.*

**Do this using `GROUP BY` and aggregate functions (e.g. `COUNT`, `SUM`, `MAX`, `MIN`)**.  Write your query here:

In [13]:
%%sql
SELECT n1.region
FROM (
    SELECT region, MIN(nuclear) AS min_state
    FROM energy
    WHERE nuclear > 0.0
    GROUP BY region) AS n1
WHERE n1.min_state >= (
    SELECT 0.1 * MAX(n2.nuclear) 
    FROM energy AS n2);

Done.

[(u'Mid Atlantic',), (u'Southeast',)]

### Part (d):

Do the same as above, except do **not** use `GROUP BY` or any aggregate functions.  Write your query here:

In [14]:
%%sql
SELECT region
FROM (
    SELECT region, nuclear AS min_state
    FROM energy AS e1
    WHERE nuclear > 0.0
    AND NOT EXISTS (
        SELECT e2.nuclear 
        FROM energy AS e2 
        WHERE e2.region = e1.region AND nuclear > 0.0
            AND e2.nuclear < e1.nuclear)) AS e3
WHERE NOT EXISTS (
    SELECT e4.nuclear
    FROM energy AS e4
    WHERE 0.1 * e4.nuclear > e3.min_state);

Done.

[(u'Mid Atlantic',), (u'Southeast',)]

Problem 3: Classification
--------------------------------------------------

SQL is a very [expressive language](http://wiki.postgresql.org/wiki/Mandelbrot_set) (some SQL extensions are known to be [Turing complete](http://stackoverflow.com/questions/900055/is-sql-or-even-tsql-turing-complete/7580013#7580013)). Here, we go through the steps of using it for a simple machine learning task: _binary classification_.

We will use a subset of the [Iris](https://archive.ics.uci.edu/ml/datasets/Iris) dataset. The reduced dataset included here as table IRIS, is comprised of $100$ samples with features SepalLength, SepalWidth, PetalLength, PetalWidth and labels 0 (identifying the species Iris-setosa) and 1 (the species Iris-versicolor). Samples of the third class (Iris-virginica) present in the original dataset have been dropped for this exercise.

In [15]:
%sql SELECT * FROM IRIS LIMIT 5;

Done.

[(0, 5.1, 3.5, 1.4, 0.2, 0),
 (1, 4.9, 3.0, 1.4, 0.2, 0),
 (2, 4.7, 3.2, 1.3, 0.2, 0),
 (3, 4.6, 3.1, 1.5, 0.2, 0),
 (4, 5.0, 3.6, 1.4, 0.2, 0)]

**Model**

We will use a simple _linear model_ to predict the label (species) given the four features included in the dataset.
An unlabeled sample $x_i \in \mathbb{R}^4$ is a vector the four given feature values. For example, the first sample in our dataset is $x_0=[5.1, 3.5, 1.4, 0.2]^\top$.
This model, known as the [Perceptron](https://en.wikipedia.org/wiki/Perceptron), is also represented as a four-dimensional vector $w \in \mathbb{R}^4$. Given sample $x_i$ and model $w$ the perceptron makes the following prediction $\hat{y}_i$ for the true label, $y_i$ of sample $x_i$:
$$
    \hat{y}_i={\begin{cases}1&{\text{if }} x_i^\top w >0\\0&{\text{otherwise}}\end{cases}}
$$

A pre-trained model, $w$, is included in table MODEL.

In [16]:
%sql SELECT * FROM MODEL;

Done.

[(0, 0.35260621), (1, -0.90142873), (2, 0.59729474), (3, 1.30194557)]

### Part (a): Matrix-vector multiplication

If we consider the _feature matrix_, $X$, whose $i$-th row is $x_i^\top$, the prediction rule for all samples becomes:
$$
    \hat{y}= \mathrm{step}(X w)
$$
where $Xw$ is a matrix-vector multiplication and
$$
    \mathrm{step}(z)_i={\begin{cases}1&{\text{if }} z_i >0\\0&{\text{otherwise}}\end{cases}}.
$$
The final product, $\hat{y} \in \{0,1\}^n$ is a vector with the predictions for all samples.

The product of a matrix $X$ (having dimensions $n\times m$) and a vector $w$ (having dimensions $m\times 1$) is the vector $c$ (of dimension $n\times 1$) having cell at row $i$ and column $j$ equal to:

$$c_{i} = \sum_{j=1}^m X_{ij}w_{j}$$

In other words, to do matrix-vector multiplication, get each cell of the resulting vector $c$, $c_{i}$, by taking the _dot product_ of the $i$th row of $X$ and the $w$.

We start by preprocessing IRIS to create the $X$ feature matrix, using the following schema:

> * `i INT`:   Row index
> * `j INT`:   Column index
> * `val INT`: Cell value

In order to streamline the work in this section we will make use of views. A view is a virtual table based on the output set of a SQL query. A view can be used just like a normal table; the only difference under the hood is that the DBMS re-evaluates the query used to generate it each time a view is queried by a user (thus the data is always up-to date!)

In [17]:
%%sql
DROP VIEW IF EXISTS X;
CREATE VIEW X AS
SELECT i, 0 as j, SepalLength as val
FROM IRIS
UNION
SELECT i, 1 as j, SepalWidth as val
FROM IRIS
UNION
SELECT i, 2 as j, PetalLength as val
FROM IRIS
UNION
SELECT i, 3 as j, PetalWidth as val
FROM IRIS;

Done.
Done.

[]

In [18]:
%sql SELECT * FROM X LIMIT 5;

Done.

[(0, 0, 5.1), (0, 1, 3.5), (0, 2, 1.4), (0, 3, 0.2), (1, 0, 4.9)]

Write a single SQL statement that implements the matrix-vector multiply $Xw$ between the provided view $X$ and model $w$ from table MODEL. Return the first 5 tuples as your answer.

Write your query here:

In [19]:
%%sql SELECT X.i, SUM(X.val * MODEL.val) AS val
FROM X, MODEL
WHERE X.j = MODEL.j
GROUP BY X.i
LIMIT 5;

Done.

[(0, -0.26010713400000024),
 (1, 0.12008598900000017),
 (2, -0.19045047300000034),
 (3, -0.016109273000000146),
 (4, -0.38551062799999997)]

### Part (b): Predict labels

Now we can predict the labels using the following rule:
$$
    \hat{y}= \mathrm{step}(X w)
$$

Create a view named 'PREDICTION' that will produce tuples of sample IDs and label predictions, i.e. $(i,\hat{y}_i)$.

**Not sure you got the previous question right?**
The provided view 'ANSWER_P3a' with schema $(i,(Xw)_i)$ has the right answer. You can use it in your solution here for full credit in this question. **Warning**: Using this view in Part (a) is against the rules.

Write your query in the following cell:

In [20]:
%%sql
DROP VIEW IF EXISTS PREDICTION;
CREATE VIEW PREDICTION AS
SELECT A.i, (SUM(A.val * B.val)>=0) AS val
FROM X as A, MODEL AS B
WHERE A.j = B.j
GROUP BY A.i;

Done.
Done.

[]

#### Using given answer view

In [22]:
%%sql
DROP VIEW IF EXISTS PREDICTION_B;
CREATE VIEW PREDICTION_B AS
SELECT AV.i, (AV.val>=0) AS val
FROM ANSWER_P3a as AV;

Done.
Done.

[]

### Part (c): Evaluate accuracy

Given the predicted labels $\hat{y}_i$ and true labels $y_i$ we evaluate the predictive power of our model using _accuracy_: the fraction of labels our model got right.
$$
    \mathrm{accuracy} 
    = \frac{1}{n}\sum_{i=1}^n \mathbb{I}[y_i = \hat{y}_i]
$$

Using the 'PREDICTION' view from the previous part should make for a simpler solution.

**Not sure you got the previous question right?**
The provided view 'ANSWER_P3b' with schema $(i,\hat{y}_i)$ has the right answer. You can use it in your solution here for full credit in this question. **Warning**: Using this view in Part (b) is against the rules.

Write your query here:

In [24]:
%%sql SELECT avg(p.val=IRIS.Label) as accuracy
FROM PREDICTION p, IRIS
WHERE p.i=IRIS.i;

Done.

[(0.87,)]

#### Using given answer view

In [25]:
%%sql SELECT avg(p.val=IRIS.Label) as accuracy
FROM ANSWER_P3b p, IRIS
WHERE p.i=IRIS.i;

Done.

[(0.87,)]

Our pre-trained classifer achieved a classification accuracy of 87%. If you don't think this is good enough, you are correct. This is not an optimally trained model. Try the bonus question to see how this classification performance can be improved!

### Bonus Problem 1: Classification, Pt. II

A simple procedure from training the model $w$ given labeled data, is as follows.
$$
    w' = w + 0.0001 \sum_{i=1}^n (y_i-\hat{y_i})x_i
$$
This kind of optimization algorithm is typically applied iteratively, but here we will just run a single step. 

Run a SQL statement that computes the new model value, $w'$, based on the original model $w$ in MODEL and the samples $x_i$ in IRIS. 

**Using answers from previous parts.**
As before, you should feel free to use the provided views 'ANSWER_P3a' and 'ANSWER_P3b' described in parts (b) and (c) in your solution for full credit in this question. **Warning**: Using these views in Parts (a) and (b) respectively is against the rules.

Write your answer here:

In [26]:
%%sql SELECT MODEL.j, MODEL.val + sum(DELTA.val*ie.val) as val
FROM MODEL, X ie, (
    SELECT IRIS.i, 0.0001*(IRIS.Label - p.val) as val
    FROM IRIS, PREDICTION p
    WHERE IRIS.i=p.i
) as DELTA
WHERE ie.i=DELTA.i and ie.j=MODEL.j
GROUP BY MODEL.j;

Done.

[(0, 0.34618621), (1, -0.90557873), (2, 0.5952347400000001), (3, 1.30153557)]

#### Using given answer view

In [27]:
%%sql SELECT MODEL.j, MODEL.val + sum(DELTA.val*ie.val) as val
FROM MODEL, X ie, (
    SELECT IRIS.i, 0.0001*(IRIS.Label - p.val) as val
    FROM IRIS, ANSWER_P3b p
    WHERE IRIS.i=p.i
) as DELTA
WHERE ie.i=DELTA.i and ie.j=MODEL.j
GROUP BY MODEL.j;

Done.

[(0, 0.34618621), (1, -0.90557873), (2, 0.5952347400000001), (3, 1.30153557)]

We have a new model now. If you perform the evaluation process for this new model, you should find that accuracy has increased to 90%. Not bad for a single step of the algorithm! Further iterations will improve this performance more.